
public class lesson300824 {

    public static void main(String[] args) {

        System.out.println("Hello");

    }

}

// /**Задана натуральная степень к. Сформировать слу4айным образом список коэффициентов (значения от 0 до 100) многочлена, многочлен степени к.
// Пример: к=2=>2*х2+4*х+5=0 или ж2+5=0 или 10*х2=0
// Даны два файла, в каждом из которых находится запись многочлена. Сформировать файл содержащий сумму многочленов.
